[Killed] BlockStatement
index.js:1:62
-export const convertToLowerOrUpperCase = (arr, caseParam) => {
-  if (!arr || !caseParam) return;
-  return arr.map((str, index) => {
-    if (caseParam.toLowerCase() === 'upper') {
-      return str.toUpperCase();
-    } else if (caseParam.toLowerCase() === 'lower') {
-      return str.toLowerCase();
-    } else return str;
-  });
-};
+export const convertToLowerOrUpperCase = (arr, caseParam) => {};
 
 export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
killedBy: task1 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["LOWER", "UPPER"]
Received: undefined

[Killed] BooleanLiteral
index.js:2:15
 export const convertToLowerOrUpperCase = (arr, caseParam) => {
-  if (!arr || !caseParam) return;
+  if (!arr || caseParam) return;
   return arr.map((str, index) => {
     if (caseParam.toLowerCase() === 'upper') {
killedBy: task1 should return undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] LogicalOperator
index.js:2:7
 export const convertToLowerOrUpperCase = (arr, caseParam) => {
-  if (!arr || !caseParam) return;
+  if (!arr && !caseParam) return;
   return arr.map((str, index) => {
     if (caseParam.toLowerCase() === 'upper') {
killedBy: task1 should return undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
index.js:3:34
 export const convertToLowerOrUpperCase = (arr, caseParam) => {
   if (!arr || !caseParam) return;
-  return arr.map((str, index) => {
-    if (caseParam.toLowerCase() === 'upper') {
-      return str.toUpperCase();
-    } else if (caseParam.toLowerCase() === 'lower') {
-      return str.toLowerCase();
-    } else return str;
-  });
+  return arr.map((str, index) => {});
 };
 
killedBy: task1 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "LOWER",
-   "UPPER",

[Killed] ConditionalExpression
index.js:4:9
 export const convertToLowerOrUpperCase = (arr, caseParam) => {
   if (!arr || !caseParam) return;
   return arr.map((str, index) => {
-    if (caseParam.toLowerCase() === 'upper') {
+    if (true) {
       return str.toUpperCase();
     } else if (caseParam.toLowerCase() === 'lower') {
killedBy: task1 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "lower",
-   "upper",

[Killed] BlockStatement
index.js:4:46
 export const convertToLowerOrUpperCase = (arr, caseParam) => {
   if (!arr || !caseParam) return;
   return arr.map((str, index) => {
-    if (caseParam.toLowerCase() === 'upper') {
-      return str.toUpperCase();
-    } else if (caseParam.toLowerCase() === 'lower') {
+    if (caseParam.toLowerCase() === 'upper') {} else if (caseParam.toLowerCase() === 'lower') {
       return str.toLowerCase();
     } else return str;
killedBy: task1 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "LOWER",
-   "UPPER",

[Killed] MethodExpression
index.js:5:14
   if (!arr || !caseParam) return;
   return arr.map((str, index) => {
     if (caseParam.toLowerCase() === 'upper') {
-      return str.toUpperCase();
+      return str.toLowerCase();
     } else if (caseParam.toLowerCase() === 'lower') {
       return str.toLowerCase();
killedBy: task1 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "LOWER",
-   "UPPER",

[Killed] BlockStatement
index.js:6:53
   return arr.map((str, index) => {
     if (caseParam.toLowerCase() === 'upper') {
       return str.toUpperCase();
-    } else if (caseParam.toLowerCase() === 'lower') {
-      return str.toLowerCase();
-    } else return str;
+    } else if (caseParam.toLowerCase() === 'lower') {} else return str;
   });
 };
killedBy: task1 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "lower",
-   "upper",

[Killed] ConditionalExpression
index.js:6:16
   return arr.map((str, index) => {
     if (caseParam.toLowerCase() === 'upper') {
       return str.toUpperCase();
-    } else if (caseParam.toLowerCase() === 'lower') {
+    } else if (false) {
       return str.toLowerCase();
     } else return str;
killedBy: task1 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "lower",
-   "upper",

[Killed] MethodExpression
index.js:7:14
     if (caseParam.toLowerCase() === 'upper') {
       return str.toUpperCase();
     } else if (caseParam.toLowerCase() === 'lower') {
-      return str.toLowerCase();
+      return str.toUpperCase();
     } else return str;
   });
killedBy: task1 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "lower",
-   "upper",

[Killed] BlockStatement
index.js:12:70
   });
 };
 
-export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
-  if (!arr || !caseParam) return;
-  return arr
-    .filter((str) => typeof str === 'string')
-    .map((str) => {
-      if (caseParam.toLowerCase() === 'upper') {
-        return str.toUpperCase();
-      } else if (caseParam.toLowerCase() === 'lower') {
-        return str.toLowerCase();
-      } else return str;
-    });
-};
+export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {};
 
 export const filterUsersByAge = (users) => {
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["LOWER", "UPPER"]
Received: undefined

[Killed] LogicalOperator
index.js:13:7
 };
 
 export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
-  if (!arr || !caseParam) return;
+  if (!arr && !caseParam) return;
   return arr
     .filter((str) => typeof str === 'string')
killedBy: task2 should return undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
index.js:13:7
 };
 
 export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
-  if (!arr || !caseParam) return;
+  if (false) return;
   return arr
     .filter((str) => typeof str === 'string')
killedBy: task2 should return undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] MethodExpression
index.js:14:10
 
 export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
   if (!arr || !caseParam) return;
-  return arr
-    .filter((str) => typeof str === 'string')
+  return arr
     .map((str) => {
       if (caseParam.toLowerCase() === 'upper') {
killedBy: task2 should work
statusReason: TypeError: str.toLowerCase is not a function

[Killed] ConditionalExpression
index.js:15:22
 export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
   if (!arr || !caseParam) return;
   return arr
-    .filter((str) => typeof str === 'string')
+    .filter((str) => false)
     .map((str) => {
       if (caseParam.toLowerCase() === 'upper') {
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "LOWER",
-   "UPPER",

[Killed] EqualityOperator
index.js:15:22
 export const convertToFilteredLowerOrUpperCase = (arr, caseParam) => {
   if (!arr || !caseParam) return;
   return arr
-    .filter((str) => typeof str === 'string')
+    .filter((str) => typeof str !== 'string')
     .map((str) => {
       if (caseParam.toLowerCase() === 'upper') {
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "LOWER",
-   "UPPER",

[Killed] BlockStatement
index.js:16:19
   if (!arr || !caseParam) return;
   return arr
     .filter((str) => typeof str === 'string')
-    .map((str) => {
-      if (caseParam.toLowerCase() === 'upper') {
-        return str.toUpperCase();
-      } else if (caseParam.toLowerCase() === 'lower') {
-        return str.toLowerCase();
-      } else return str;
-    });
+    .map((str) => {});
 };
 
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "LOWER",
-   "UPPER",

[Killed] EqualityOperator
index.js:17:11
   return arr
     .filter((str) => typeof str === 'string')
     .map((str) => {
-      if (caseParam.toLowerCase() === 'upper') {
+      if (caseParam.toLowerCase() !== 'upper') {
         return str.toUpperCase();
       } else if (caseParam.toLowerCase() === 'lower') {
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "LOWER",
-   "UPPER",

[Killed] ConditionalExpression
index.js:17:11
   return arr
     .filter((str) => typeof str === 'string')
     .map((str) => {
-      if (caseParam.toLowerCase() === 'upper') {
+      if (true) {
         return str.toUpperCase();
       } else if (caseParam.toLowerCase() === 'lower') {
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "lower",
+   "LOWER",

[Killed] EqualityOperator
index.js:19:18
     .map((str) => {
       if (caseParam.toLowerCase() === 'upper') {
         return str.toUpperCase();
-      } else if (caseParam.toLowerCase() === 'lower') {
+      } else if (caseParam.toLowerCase() !== 'lower') {
         return str.toLowerCase();
       } else return str;
killedBy: task2 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "lower",
-   "UPPER",

[Killed] BlockStatement
index.js:25:44
     });
 };
 
-export const filterUsersByAge = (users) => {
-  if (!users) return;
-  return users.filter((user) => user.age >= 18);
-};
+export const filterUsersByAge = (users) => {};
 
 export const filterUsersByParam = (users, param, paramValue, bracket) => {
killedBy: task3 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"age": 25, "name": "Alice"}, {"age": 30, "name": "Charlie"}]
Received: undefined

[Killed] ConditionalExpression
index.js:26:7
 };
 
 export const filterUsersByAge = (users) => {
-  if (!users) return;
+  if (true) return;
   return users.filter((user) => user.age >= 18);
 };
killedBy: task3 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"age": 25, "name": "Alice"}, {"age": 30, "name": "Charlie"}]
Received: undefined

[Killed] ConditionalExpression
index.js:26:7
 };
 
 export const filterUsersByAge = (users) => {
-  if (!users) return;
+  if (false) return;
   return users.filter((user) => user.age >= 18);
 };
killedBy: task3 should return undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] MethodExpression
index.js:27:10
 
 export const filterUsersByAge = (users) => {
   if (!users) return;
-  return users.filter((user) => user.age >= 18);
+  return users;
 };
 
killedBy: task3 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

@@ -2,9 +2,17 @@
    Object {
      "age": 25,

[Killed] EqualityOperator
index.js:27:33
 
 export const filterUsersByAge = (users) => {
   if (!users) return;
-  return users.filter((user) => user.age >= 18);
+  return users.filter((user) => user.age < 18);
 };
 
killedBy: task3 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    Object {
-     "age": 25,

[Killed] BlockStatement
index.js:30:74
   return users.filter((user) => user.age >= 18);
 };
 
-export const filterUsersByParam = (users, param, paramValue, bracket) => {
-  if (!users || !param) return;
-  switch (typeof paramValue) {
-    case 'boolean':
-      return users.filter((user) => user[param] === paramValue);
-    case 'number':
-      return bracket === '>'
-        ? users.filter((user) => user[param] > paramValue)
-        : users.filter((user) => user[param] < paramValue);
-    default:
-      return null;
-  }
-};
+export const filterUsersByParam = (users, param, paramValue, bracket) => {};
 
 export const divisibleAverage = (numbers, divisor) => {
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"age": 25, "capableOfMarathon": true, "name": "Alice"}, {"age": 30, "capableOfMarathon": false, "name": "Charlie"}]
Received: undefined

[Killed] ConditionalExpression
index.js:31:7
 };
 
 export const filterUsersByParam = (users, param, paramValue, bracket) => {
-  if (!users || !param) return;
+  if (false) return;
   switch (typeof paramValue) {
     case 'boolean':
killedBy: task4 should return undefined
statusReason: Error: expect(received).toBeUndefined()

Received: null

[Killed] BooleanLiteral
index.js:31:7
 };
 
 export const filterUsersByParam = (users, param, paramValue, bracket) => {
-  if (!users || !param) return;
+  if (users || !param) return;
   switch (typeof paramValue) {
     case 'boolean':
killedBy: task4 should return undefined
statusReason: Error: expect(received).toBeUndefined()

Received: null

[Killed] ConditionalExpression
index.js:33:5
 export const filterUsersByParam = (users, param, paramValue, bracket) => {
   if (!users || !param) return;
   switch (typeof paramValue) {
-    case 'boolean':
-      return users.filter((user) => user[param] === paramValue);
+    case 'boolean':
     case 'number':
       return bracket === '>'
killedBy: task4 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  6

  Array [
    Object {
-     "age": 25,

[Killed] StringLiteral
index.js:33:10
 export const filterUsersByParam = (users, param, paramValue, bracket) => {
   if (!users || !param) return;
   switch (typeof paramValue) {
-    case 'boolean':
+    case "":
       return users.filter((user) => user[param] === paramValue);
     case 'number':
killedBy: task4 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"age": 25, "capableOfMarathon": true, "name": "Alice"}, {"age": 16, "capableOfMarathon": true, "name": "David"}, {"age": 18, "capableOfMarathon": true, "name": "Gwen"}]
Received: null

[Killed] MethodExpression
index.js:34:14
   if (!users || !param) return;
   switch (typeof paramValue) {
     case 'boolean':
-      return users.filter((user) => user[param] === paramValue);
+      return users;
     case 'number':
       return bracket === '>'
killedBy: task4 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -3,10 +3,20 @@
      "age": 25,
      "capableOfMarathon": true,

[Killed] ConditionalExpression
index.js:34:37
   if (!users || !param) return;
   switch (typeof paramValue) {
     case 'boolean':
-      return users.filter((user) => user[param] === paramValue);
+      return users.filter((user) => false);
     case 'number':
       return bracket === '>'
killedBy: task4 should work 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   Object {
-     "age": 25,

[Killed] ConditionalExpression
index.js:35:5
   switch (typeof paramValue) {
     case 'boolean':
       return users.filter((user) => user[param] === paramValue);
-    case 'number':
-      return bracket === '>'
-        ? users.filter((user) => user[param] > paramValue)
-        : users.filter((user) => user[param] < paramValue);
+    case 'number':
     default:
       return null;
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"age": 25, "capableOfMarathon": true, "name": "Alice"}, {"age": 30, "capableOfMarathon": false, "name": "Charlie"}]
Received: null

[Killed] ConditionalExpression
index.js:36:14
     case 'boolean':
       return users.filter((user) => user[param] === paramValue);
     case 'number':
-      return bracket === '>'
+      return true
         ? users.filter((user) => user[param] > paramValue)
         : users.filter((user) => user[param] < paramValue);
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "age": 17,

[Killed] EqualityOperator
index.js:36:14
     case 'boolean':
       return users.filter((user) => user[param] === paramValue);
     case 'number':
-      return bracket === '>'
+      return bracket !== '>'
         ? users.filter((user) => user[param] > paramValue)
         : users.filter((user) => user[param] < paramValue);
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
    Object {
-     "age": 25,

[Killed] ConditionalExpression
index.js:37:34
       return users.filter((user) => user[param] === paramValue);
     case 'number':
       return bracket === '>'
-        ? users.filter((user) => user[param] > paramValue)
+        ? users.filter((user) => true)
         : users.filter((user) => user[param] < paramValue);
     default:
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 15

@@ -3,10 +3,25 @@
      "age": 25,
      "capableOfMarathon": true,

[Killed] EqualityOperator
index.js:37:34
       return users.filter((user) => user[param] === paramValue);
     case 'number':
       return bracket === '>'
-        ? users.filter((user) => user[param] > paramValue)
+        ? users.filter((user) => user[param] <= paramValue)
         : users.filter((user) => user[param] < paramValue);
     default:
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  5
+ Received  + 10

  Array [
    Object {
-     "age": 25,

[Killed] EqualityOperator
index.js:38:34
     case 'number':
       return bracket === '>'
         ? users.filter((user) => user[param] > paramValue)
-        : users.filter((user) => user[param] < paramValue);
+        : users.filter((user) => user[param] <= paramValue);
     default:
       return null;
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -7,6 +7,11 @@
    Object {
      "age": 16,

[Killed] MethodExpression
index.js:38:11
     case 'number':
       return bracket === '>'
         ? users.filter((user) => user[param] > paramValue)
-        : users.filter((user) => user[param] < paramValue);
+        : users;
     default:
       return null;
killedBy: task4 should work
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 15

  Array [
    Object {
+     "age": 25,

[Killed] ConditionalExpression
index.js:39:5
       return bracket === '>'
         ? users.filter((user) => user[param] > paramValue)
         : users.filter((user) => user[param] < paramValue);
-    default:
-      return null;
+    default:
   }
 };
killedBy: task4 should work
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
index.js:44:55
   }
 };
 
-export const divisibleAverage = (numbers, divisor) => {
-  if (!numbers || !divisor || numbers.length === 0) return;
-  return numbers
-    .filter((num) => num % divisor === 0)
-    .reduce((acc, curr, index, array) => {
-      acc += curr;
-      if (index === array.length - 1) {
-        return acc / array.length;
-      } else {
-        return acc;
-      }
-    }, 0);
-};
+export const divisibleAverage = (numbers, divisor) => {};
 
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] ConditionalExpression
index.js:45:7
 };
 
 export const divisibleAverage = (numbers, divisor) => {
-  if (!numbers || !divisor || numbers.length === 0) return;
+  if (true) return;
   return numbers
     .filter((num) => num % divisor === 0)
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] BooleanLiteral
index.js:45:19
 };
 
 export const divisibleAverage = (numbers, divisor) => {
-  if (!numbers || !divisor || numbers.length === 0) return;
+  if (!numbers || divisor || numbers.length === 0) return;
   return numbers
     .filter((num) => num % divisor === 0)
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] MethodExpression
index.js:46:10
 
 export const divisibleAverage = (numbers, divisor) => {
   if (!numbers || !divisor || numbers.length === 0) return;
-  return numbers
-    .filter((num) => num % divisor === 0)
+  return numbers
     .reduce((acc, curr, index, array) => {
       acc += curr;
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 21.285714285714285

[Killed] ArrowFunction
index.js:47:13
 export const divisibleAverage = (numbers, divisor) => {
   if (!numbers || !divisor || numbers.length === 0) return;
   return numbers
-    .filter((num) => num % divisor === 0)
+    .filter(() => undefined)
     .reduce((acc, curr, index, array) => {
       acc += curr;
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 0

[Killed] ArithmeticOperator
index.js:47:22
 export const divisibleAverage = (numbers, divisor) => {
   if (!numbers || !divisor || numbers.length === 0) return;
   return numbers
-    .filter((num) => num % divisor === 0)
+    .filter((num) => num * divisor === 0)
     .reduce((acc, curr, index, array) => {
       acc += curr;
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 0

[Killed] BlockStatement
index.js:48:42
   if (!numbers || !divisor || numbers.length === 0) return;
   return numbers
     .filter((num) => num % divisor === 0)
-    .reduce((acc, curr, index, array) => {
-      acc += curr;
-      if (index === array.length - 1) {
-        return acc / array.length;
-      } else {
-        return acc;
-      }
-    }, 0);
+    .reduce((acc, curr, index, array) => {}, 0);
 };
 
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] AssignmentOperator
index.js:49:7
   return numbers
     .filter((num) => num % divisor === 0)
     .reduce((acc, curr, index, array) => {
-      acc += curr;
+      acc -= curr;
       if (index === array.length - 1) {
         return acc / array.length;
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: -15

[Killed] BlockStatement
index.js:50:39
     .filter((num) => num % divisor === 0)
     .reduce((acc, curr, index, array) => {
       acc += curr;
-      if (index === array.length - 1) {
-        return acc / array.length;
-      } else {
+      if (index === array.length - 1) {} else {
         return acc;
       }
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] EqualityOperator
index.js:50:11
     .filter((num) => num % divisor === 0)
     .reduce((acc, curr, index, array) => {
       acc += curr;
-      if (index === array.length - 1) {
+      if (index !== array.length - 1) {
         return acc / array.length;
       } else {
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 30

[Killed] ArithmeticOperator
index.js:51:16
     .reduce((acc, curr, index, array) => {
       acc += curr;
       if (index === array.length - 1) {
-        return acc / array.length;
+        return acc * array.length;
       } else {
         return acc;
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: 60

[Killed] BlockStatement
index.js:52:14
       acc += curr;
       if (index === array.length - 1) {
         return acc / array.length;
-      } else {
-        return acc;
-      }
+      } else {}
     }, 0);
 };
killedBy: task5 should count
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: NaN
